# Pandas

In [1]:
## Numpy and Pandas are very important for exploratory data analysis

In [1]:
## Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

## Agenda

## What is Data Frames?
## What is Data Series?
## Different operation in Pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
# creating data frame

In [4]:
df = pd.DataFrame(np.arange(100,120).reshape(5,4),index = ['Raw1','Raw2','Raw3','Raw4','Raw5'],columns = ['c1','c2','c3','c4'])

In [5]:
df.head()

       c1   c2   c3   c4
Raw1  100  101  102  103
Raw2  104  105  106  107
Raw3  108  109  110  111
Raw4  112  113  114  115
Raw5  116  117  118  119

In [5]:
df.to_csv("Panda_test.csv")

In [6]:
# two ways to access

In [7]:
# 1 .loc    2.   .iloc

In [8]:
df.loc['Raw1']

c1    100
c2    101
c3    102
c4    103
Name: Raw1, dtype: int32

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.iloc[:,:]

       c1   c2   c3   c4
Raw1  100  101  102  103
Raw2  104  105  106  107
Raw3  108  109  110  111
Raw4  112  113  114  115
Raw5  116  117  118  119

In [11]:
df.iloc[1:3,:]

       c1   c2   c3   c4
Raw2  104  105  106  107
Raw3  108  109  110  111

In [12]:
df.iloc[:,0:3]

       c1   c2   c3
Raw1  100  101  102
Raw2  104  105  106
Raw3  108  109  110
Raw4  112  113  114
Raw5  116  117  118

In [13]:
df.iloc[:2,0:3]

       c1   c2   c3
Raw1  100  101  102
Raw2  104  105  106